
# Pandas

In [8]:
import pandas as pd

# series
like a column in a table/dataframe

In [9]:
#creating a series
days=['Monday','Tuesday','Wednesday','Thrusday','Friday','Saturday','Sunday']
my_series=pd.Series(days,index=range(1,8))
#my_series=pd.Series(days,index=[10,11,12,13,14,15])
print(my_series)
type(my_series)

1       Monday
2      Tuesday
3    Wednesday
4     Thrusday
5       Friday
6     Saturday
7       Sunday
dtype: object

pandas.core.series.Series

In [10]:
#creating series using dictionary
dict={'1':'monday','2':'Tuesday','3':'wednesday','4':'thrusday','5':'friday','6':'saturday','7':'sunday'}
ser=pd.Series(dict)
ser

1       monday
2      Tuesday
3    wednesday
4     thrusday
5       friday
6     saturday
7       sunday
dtype: object

In [11]:
dict={'1':['monday','a'],'2':['Tuesday','b'],'3':'wednesday','4':'thrusday','5':'friday','6':'saturday','7':'sunday'}
ser=pd.Series(dict)
ser

1     [monday, a]
2    [Tuesday, b]
3       wednesday
4        thrusday
5          friday
6        saturday
7          sunday
dtype: object

# Dataframes
dataframes is most commonly used object in  pandas. it is a table like datastructure containing rows and columns simlilar to excel spreadsheet

In [12]:
#creating a dataframe using a dictionary
max_temp=[18,19,20,21,16,21,22]
min_temp=[10,13,12,8,7,11,21]
event=['Rain','thunderstorm','rain','sunny','fog','fog','rain']
windspeed=[10,14,8,14,18,11,14]
weather={'days':days, 'max temperature':max_temp, 'min temperature':min_temp,'windspeed':windspeed,'Events':event}
df=pd.DataFrame(weather,index=range(1,8))
df

        days  max temperature  min temperature  windspeed        Events
1     Monday               18               10         10          Rain
2    Tuesday               19               13         14  thunderstorm
3  Wednesday               20               12          8          rain
4   Thrusday               21                8         14         sunny
5     Friday               16                7         18           fog
6   Saturday               21               11         11           fog
7     Sunday               22               21         14          rain

# exporting a dataframe to a csv file

In [13]:
df.to_csv('weather data.csv')

# Importing from a csv file

In [32]:
new_df=pd.read_csv('weather data.csv')

In [33]:
new_df

,Unnamed: 0,days,max temperature,min temperature,windspeed,Events,humidity
0,1,Monday,18,10,10,Rain,34
1,2,Tuesday,19,13,14,thunderstorm,6
2,3,Wednesday,20,12,8,rain,74
3,4,Thrusday,21,8,14,sunny,45
4,5,Friday,16,7,18,fog,67
5,6,Saturday,21,11,11,fog,56
6,7,Sunday,22,21,14,rain,43

In [31]:
a,b=new_df.shape
print('no of rows',a,'no of column',b)

no of rows 7 no of column 6

In [17]:
new_df.columns

Index(['Unnamed: 0', 'days', 'max temperature', 'min temperature', 'windspeed',
       'Events'],
      dtype='object')

In [24]:
#creating a dataframe using dictionary
english=[20,30,40,56,78]
maths=[20,40,56,34,65]
science=[89,56,7,87,45]
name=['aman','ayush','tushar','shubham','sambhav']
marks={'name':name, 'english':english,'maths':maths,'science':science}
df1=pd.DataFrame(marks,index=range(1,6))

In [25]:
df1

      name  english  maths  science
1     aman       20     20       89
2    ayush       30     40       56
3   tushar       40     56        7
4  shubham       56     34       87
5  sambhav       78     65       45

In [26]:
df1.to_csv('marks.csv')

In [29]:
new_df2=pd.read_csv('marks.csv')
new_df2

   index     name  english  maths  science  hindi
0      1     aman       20     20       89     34
1      2    ayush       30     40       56     65
2      3   tushar       40     56        7     78
3      4  shubham       56     34       87     67
4      5  sambhav       78     65       45     90

In [36]:
new_df2['english'].max()

78